require 'spec_helper'
RSpec.describe YaKansuji::Formatter::JudicH do
  def k(num, opt = {})
    subject.call num, opt
  end

  it 'can convert number to kansuji' do
    expect(k(0)).to eq '０'
    expect(k(1)).to eq '１'
    expect(k(1234)).to eq '１２３４'
    expect(k(10_003)).to eq '１万０００３'
    expect(k(10_010_003)).to eq '１００１万０００３'
    expect(k(100_000_003)).to eq '１億０００３'
    expect(k(200_000_000_056)).to eq '２０００億００５６'
    expect(k(9_030_000_001_008)).to eq '９兆０３００億１００８'
    expect(k(1_000_100_010_000)).to eq '１兆０００１億０００１万'

    expect(k(9_999_999)).to eq '９９９万９９９９'
    expect(k(900_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000)).to eq '９０不可思議'
    expect(k(100_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000_000)).to eq '１無量大数'
    expect(k(111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111_111)).to eq '１１１１無量大数１１１１不可思議１１１１那由他１１１１阿僧祇１１１１恒河沙１１１１極１１１１載１１１１正１１１１澗１１１１溝１１１１穣１１１１𥝱１１１１垓１１１１京１１１１兆１１１１億１１１１万１１１１'
    expect(k(999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999_999)).to eq '９９９９無量大数９９９９不可思議９９９９那由他９９９９阿僧祇９９９９恒河沙９９９９極９９９９載９９９９正９９９９澗９９９９溝９９９９穣９９９９𥝱９９９９垓９９９９京９９９９兆９９９９億９９９９万９９９９'
  end
end
