require "spec_helper"
RSpec.describe YaKansuji::Formatter::JudicV do
  def k(num, opt = {})
    subject.call num, opt
  end

  it "can convert number to kansuji" do
    expect(k 0).to eq "〇"
    expect(k 1).to eq "一"
    expect(k(1234)).to eq "一二三四"
    expect(k(10003)).to eq "一万〇〇〇三"
    expect(k(10_010_003)).to eq "一〇〇一万〇〇〇三"
    expect(k(100_000_003)).to eq "一億〇〇〇三"
    expect(k(200_000_000_056)).to eq "二〇〇〇億〇〇五六"
    expect(k(9_030_000_001_008)).to eq "九兆〇三〇〇億一〇〇八"
    expect(k 1000100010000).to eq "一兆〇〇〇一億〇〇〇一万"

    expect(k 9999999).to eq "九九九万九九九九"
    expect(k 900000000000000000000000000000000000000000000000000000000000000000).to eq "九〇不可思議"
    expect(k 100000000000000000000000000000000000000000000000000000000000000000000).to eq "一無量大数"
    expect(k 111111111111111111111111111111111111111111111111111111111111111111111111).to eq "一一一一無量大数一一一一不可思議一一一一那由他一一一一阿僧祇一一一一恒河沙一一一一極一一一一載一一一一正一一一一澗一一一一溝一一一一穣一一一一𥝱一一一一垓一一一一京一一一一兆一一一一億一一一一万一一一一"
    expect(k 999999999999999999999999999999999999999999999999999999999999999999999999).to eq "九九九九無量大数九九九九不可思議九九九九那由他九九九九阿僧祇九九九九恒河沙九九九九極九九九九載九九九九正九九九九澗九九九九溝九九九九穣九九九九𥝱九九九九垓九九九九京九九九九兆九九九九億九九九九万九九九九"
  end
end
